Repository: RapidFingers/Translator
Catalog: po/extra/*.po
Languages: fr, nl, ru

source: Translator
fr: Traducteur
nl: Vertaler

source: Simple and fast translator
fr: Traducteur simple et rapide
nl: Eenvoudige, snelle vertaaltoepassing
ru: Простой и быстрый переводчик

source: Serbian language
fr: Ajout du Serbe
nl: Servische taal
ru: Сербский язык

source: Fix desktop file
fr: Correction du fichier desktop
nl: Reparaties aan het .desktop-bestand
ru: Исправлен desktop файл

source: Slovak language
fr: Ajout du Slovaque
nl: Slowaakse taal
ru: Словацкий язык

source: Translate progress
fr: Chargement de la traduction
nl: Vertaalvoortgang
ru: Прогресс перевода

source: Fix for dark theme
fr: Correction pour le thème sombre
nl: Foutoplossing voor donker thema
ru: Исправление для тёмной темы

source: Homepage fix
fr: Correction de la page d'accueil
nl: Foutoplossing voor website
ru: Исправление домашней страницы

source: System icons
fr: Icônes système
nl: Systeempictogrammen
ru: Системные значки

source: Better dark theme look
fr: Meilleure apparence du thème sombre
nl: Verbeterd donker thema
ru: Улучшение тёмной темы

source: Toast message if no connection to server
fr: Notification en cas de non connexion au serveur
nl: Bericht bij geen verbinding met server
ru: Уведомление при отсутствии связи с сервером

source: Fix ugly text selection color
fr: Correction de la couleur de sélection moche
nl: Lelijke tekstselectiekleur gerepareerd
ru: Исправлен некрасивый цвет выделения текста

source: Minor bugfix
fr: Correction de bug mineure
nl: Kleine foutoplossing
ru: Незначительные исправления

source: Timeout before translate
fr: Délai avant traduction
nl: Time-out alvorens te vertalen
ru: Задержка перед переводом

source: Fix useless translate on language combobox click
fr: Correction de la traduction inutile au clic de sélection de langue
nl: Onnodige klik voor vertalen opgelost

source: Fixed lack of translation, when text is changed during the transfer
fr: Correction du vide de traduction, quand le texte est modifié pendant le transfert
nl: Opgelost: geen vertaling tijdens aanpassing tijdens het vertaalproces
ru: Исправлено отсутствие перевода, когда текст изменен во время передачи

source: Fixes for Juno
fr: Corrections pour Juno
nl: Foutoplossingen omtrent Juno
ru: Исправления для Juno

source: Clear button (thanks to camellan)
fr: Bouton effacer (grâce à camellan)
nl: Wisknop, met dank aan @camellan

source: Copy button (thanks to camellan)
fr: Bouton copier (grâce à camellan)
nl: Kopieerknop, met dank aan @camellan

source: More languages and translations (thanks to camellan)
fr: Plus de langues et traductions (grâce à camellan)
nl: Meer talen en vertalingen, met dank aan @camellan

source: Bug fixes (thanks to camellan)
fr: Corrections de bugs (grâce à camellan)
nl: Foutoplossingen, met dank aan @camellan

source: Translator App
fr: Application Traducteur
nl: Vertaaltoepassing
ru: Переводчик

source: Language translator
fr: Traducteur
nl: Vertaler
ru: Переводчик
